## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 50 to add, 0 to change, 50 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                                            NAME                                                                            |
|----------|------------------------------------------------------------------------------------------------------------------------------------------------------------|
| add      | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Billing-ReadOnly&quot;]`                                                                  |
|          | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-ECS-Blazer-Access&quot;]`                                                                 |
|          | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Pinpoint-SMS-Admin&quot;]`                                                                |
|          | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-QuickSight-Access&quot;]`                                                                 |
|          | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-S3-WebsiteAssets-Admin&quot;]`                                                            |
|          | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-SupportCenter-Admin&quot;]`                                                               |
|          | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Billing-ReadOnly&quot;]`                                                                        |
|          | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-ECS-Blazer-Access&quot;]`                                                                       |
|          | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Pinpoint-SMS-Admin&quot;]`                                                                      |
|          | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-S3-WebsiteAssets-Admin&quot;]`                                                                  |
|          | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-SupportCenter-Admin&quot;]`                                                                     |
| delete   | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Access-ECS-Blazer&quot;]`                                                                 |
|          | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Access-QuickSight&quot;]`                                                                 |
|          | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Admin-Pinpoint-SMS&quot;]`                                                                |
|          | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Admin-S3-WebsiteAssets&quot;]`                                                            |
|          | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Admin-SupportCenter&quot;]`                                                               |
|          | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-ReadOnly-Billing&quot;]`                                                                  |
|          | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Access-ECS-Blazer&quot;]`                                                                       |
|          | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Admin-Pinpoint-SMS&quot;]`                                                                      |
|          | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Admin-S3-WebsiteAssets&quot;]`                                                                  |
|          | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Admin-SupportCenter&quot;]`                                                                     |
|          | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-ReadOnly-Billing&quot;]`                                                                        |
| recreate | `aws_identitystore_group.articles_production_access_vpc_clientvpn`                                                                                         |
|          | `aws_identitystore_group.articles_staging_access_vpc_clientvpn`                                                                                            |
|          | `aws_identitystore_group.notify_dev_access_vpc_clientvpn`                                                                                                  |
|          | `aws_identitystore_group.notify_production_access_ecs_blazer`                                                                                              |
|          | `aws_identitystore_group.notify_production_access_quicksight`                                                                                              |
|          | `aws_identitystore_group.notify_production_access_vpc_clientvpn`                                                                                           |
|          | `aws_identitystore_group.notify_production_admin_pinpoint_sms`                                                                                             |
|          | `aws_identitystore_group.notify_production_admin_s3_website_assets`                                                                                        |
|          | `aws_identitystore_group.notify_production_admin_support_center`                                                                                           |
|          | `aws_identitystore_group.notify_production_read_only_billing`                                                                                              |
|          | `aws_identitystore_group.notify_staging_access_ecs_blazer`                                                                                                 |
|          | `aws_identitystore_group.notify_staging_access_vpc_clientvpn`                                                                                              |
|          | `aws_identitystore_group.notify_staging_admin_pinpoint_sms`                                                                                                |
|          | `aws_identitystore_group.notify_staging_admin_s3_website_assets`                                                                                           |
|          | `aws_identitystore_group.notify_staging_admin_support_center`                                                                                              |
|          | `aws_identitystore_group.notify_staging_read_only_billing`                                                                                                 |
|          | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/AWSQuickSightIoTAnalyticsAccess&quot;]`                                      |
|          | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuickSightDescribeRDS&quot;]`                                |
|          | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuickSightDescribeRedshift&quot;]`                           |
|          | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuickSightElasticsearchPolicy&quot;]`                        |
|          | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuickSightListIAM&quot;]`                                    |
|          | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuickSightTimestreamPolicy&quot;]`                           |
|          | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuicksightAthenaAccess&quot;]`                               |
|          | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/AWSQuicksightOpenSearchPolicy&quot;]`                           |
|          | `aws_ssoadmin_managed_policy_attachment.access_quicksight[&quot;arn:aws:iam::aws:policy/service-role/QuickSightAccessForS3StorageManagementAnalyticsReadOnly&quot;]` |
|          | `aws_ssoadmin_managed_policy_attachment.admin_support_center[&quot;arn:aws:iam::aws:policy/AWSSupportAccess&quot;]`                                                  |
|          | `aws_ssoadmin_managed_policy_attachment.admin_support_center[&quot;arn:aws:iam::aws:policy/CloudWatchReadOnlyAccess&quot;]`                                          |
|          | `aws_ssoadmin_permission_set.access_quicksight`                                                                                                            |
|          | `aws_ssoadmin_permission_set.admin_pinpoint_sms`                                                                                                           |
|          | `aws_ssoadmin_permission_set.admin_s3_website_assets`                                                                                                      |
|          | `aws_ssoadmin_permission_set.admin_support_center`                                                                                                         |
|          | `aws_ssoadmin_permission_set.notify_access_ecs_blazer`                                                                                                     |
|          | `aws_ssoadmin_permission_set.read_only_billing`                                                                                                            |
|          | `aws_ssoadmin_permission_set_inline_policy.access_quicksight`                                                                                              |
|          | `aws_ssoadmin_permission_set_inline_policy.admin_pinpoint_sms`                                                                                             |
|          | `aws_ssoadmin_permission_set_inline_policy.admin_s3_website_assets`                                                                                        |
|          | `aws_ssoadmin_permission_set_inline_policy.admin_support_center`                                                                                           |
|          | `aws_ssoadmin_permission_set_inline_policy.notify_access_ecs_blazer`                                                                                       |
|          | `aws_ssoadmin_permission_set_inline_policy.read_only_billing`                                                                                              |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-aws-lz/actions/runs/9033677381).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_identitystore_group.articles_production_access_vpc_clientvpn must be replaced
-/+ resource "aws_identitystore_group" "articles_production_access_vpc_clientvpn" {
      ~ display_name      = "Articles-Production-Access-VPC-ClientVPN" -> "Articles-Production-VPC-ClientVPN-Access" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "6cfd9518-40b1-7005-beaa-e7592d29b2cc" -> (known after apply)
      ~ id                = "d-9d67173bdd/6cfd9518-40b1-7005-beaa-e7592d29b2cc" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.articles_staging_access_vpc_clientvpn must be replaced
-/+ resource "aws_identitystore_group" "articles_staging_access_vpc_clientvpn" {
      ~ display_name      = "Articles-Staging-Access-VPC-ClientVPN" -> "Articles-Staging-VPC-ClientVPN-Access" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "3c7df578-d031-7065-44c9-7e72eadfe940" -> (known after apply)
      ~ id                = "d-9d67173bdd/3c7df578-d031-7065-44c9-7e72eadfe940" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_dev_access_vpc_clientvpn must be replaced
-/+ resource "aws_identitystore_group" "notify_dev_access_vpc_clientvpn" {
      ~ display_name      = "Notify-Dev-Access-VPC-ClientVPN" -> "Notify-Dev-VPC-ClientVPN-Access" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "ec6d65b8-c0a1-707a-dbe2-6e5310ebfa82" -> (known after apply)
      ~ id                = "d-9d67173bdd/ec6d65b8-c0a1-707a-dbe2-6e5310ebfa82" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_production_access_ecs_blazer must be replaced
-/+ resource "aws_identitystore_group" "notify_production_access_ecs_blazer" {
      ~ display_name      = "Notify-Production-Access-ECS-Blazer" -> "Notify-Production-ECS-Blazer-Access" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "3cdd2568-3011-7030-4f92-b48f54bf29a8" -> (known after apply)
      ~ id                = "d-9d67173bdd/3cdd2568-3011-7030-4f92-b48f54bf29a8" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_production_access_quicksight must be replaced
-/+ resource "aws_identitystore_group" "notify_production_access_quicksight" {
      ~ display_name      = "Notify-Production-Access-QuickSight" -> "Notify-Production-QuickSight-Access" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "8ccd6538-40e1-70f7-b3b4-97cf64608a14" -> (known after apply)
      ~ id                = "d-9d67173bdd/8ccd6538-40e1-70f7-b3b4-97cf64608a14" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_production_access_vpc_clientvpn must be replaced
-/+ resource "aws_identitystore_group" "notify_production_access_vpc_clientvpn" {
      ~ display_name      = "Notify-Production-Access-VPC-ClientVPN" -> "Notify-Production-VPC-ClientVPN-Access" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "4cbd1558-a0d1-7006-35b2-3ea9fe5982b4" -> (known after apply)
      ~ id                = "d-9d67173bdd/4cbd1558-a0d1-7006-35b2-3ea9fe5982b4" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_production_admin_pinpoint_sms must be replaced
-/+ resource "aws_identitystore_group" "notify_production_admin_pinpoint_sms" {
      ~ display_name      = "Notify-Production-Admin-Pinpoint-SMS" -> "Notify-Production-Pinpoint-SMS-Admin" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "3ccd2518-e051-705f-476c-e4db031b1b31" -> (known after apply)
      ~ id                = "d-9d67173bdd/3ccd2518-e051-705f-476c-e4db031b1b31" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_production_admin_s3_website_assets must be replaced
-/+ resource "aws_identitystore_group" "notify_production_admin_s3_website_assets" {
      ~ display_name      = "Notify-Production-Admin-S3-WebsiteAssets" -> "Notify-Production-S3-WebsiteAssets-Admin" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "3cdd8588-b001-7075-e6af-075e708ac27c" -> (known after apply)
      ~ id                = "d-9d67173bdd/3cdd8588-b001-7075-e6af-075e708ac27c" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_production_admin_support_center must be replaced
-/+ resource "aws_identitystore_group" "notify_production_admin_support_center" {
      ~ display_name      = "Notify-Production-Admin-SupportCenter" -> "Notify-Production-SupportCenter-Admin" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "bcfd35b8-3031-70ab-179a-5d746590354f" -> (known after apply)
      ~ id                = "d-9d67173bdd/bcfd35b8-3031-70ab-179a-5d746590354f" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_production_read_only_billing must be replaced
-/+ resource "aws_identitystore_group" "notify_production_read_only_billing" {
      ~ display_name      = "Notify-Production-ReadOnly-Billing" -> "Notify-Production-Billing-ReadOnly" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "cc9d4548-a001-7083-383f-3cc9f0f4124a" -> (known after apply)
      ~ id                = "d-9d67173bdd/cc9d4548-a001-7083-383f-3cc9f0f4124a" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_staging_access_ecs_blazer must be replaced
-/+ resource "aws_identitystore_group" "notify_staging_access_ecs_blazer" {
      ~ display_name      = "Notify-Staging-Access-ECS-Blazer" -> "Notify-Staging-ECS-Blazer-Access" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "6ceda5f8-00f1-7020-37f6-7082ffd66e97" -> (known after apply)
      ~ id                = "d-9d67173bdd/6ceda5f8-00f1-7020-37f6-7082ffd66e97" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_staging_access_vpc_clientvpn must be replaced
-/+ resource "aws_identitystore_group" "notify_staging_access_vpc_clientvpn" {
      ~ display_name      = "Notify-Staging-Access-VPC-ClientVPN" -> "Notify-Staging-VPC-ClientVPN-Access" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "5c9d6568-e0c1-70ab-3ea5-a83baa472462" -> (known after apply)
      ~ id                = "d-9d67173bdd/5c9d6568-e0c1-70ab-3ea5-a83baa472462" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_staging_admin_pinpoint_sms must be replaced
-/+ resource "aws_identitystore_group" "notify_staging_admin_pinpoint_sms" {
      ~ display_name      = "Notify-Staging-Admin-Pinpoint-SMS" -> "Notify-Staging-Pinpoint-SMS-Admin" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "6cfd2548-f071-70e7-cf44-6ad379410b49" -> (known after apply)
      ~ id                = "d-9d67173bdd/6cfd2548-f071-70e7-cf44-6ad379410b49" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_staging_admin_s3_website_assets must be replaced
-/+ resource "aws_identitystore_group" "notify_staging_admin_s3_website_assets" {
      ~ display_name      = "Notify-Staging-Admin-S3-WebsiteAssets" -> "Notify-Staging-S3-WebsiteAssets-Admin" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "dc0de538-e0d1-70a9-0a9a-857046dcccaa" -> (known after apply)
      ~ id                = "d-9d67173bdd/dc0de538-e0d1-70a9-0a9a-857046dcccaa" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_staging_admin_support_center must be replaced
-/+ resource "aws_identitystore_group" "notify_staging_admin_support_center" {
      ~ display_name      = "Notify-Staging-Admin-SupportCenter" -> "Notify-Staging-SupportCenter-Admin" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "1c4d9558-a031-7021-70cf-c90a701d4fef" -> (known after apply)
      ~ id                = "d-9d67173bdd/1c4d9558-a031-7021-70cf-c90a701d4fef" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_identitystore_group.notify_staging_read_only_billing must be replaced
-/+ resource "aws_identitystore_group" "notify_staging_read_only_billing" {
      ~ display_name      = "Notify-Staging-ReadOnly-Billing" -> "Notify-Staging-Billing-ReadOnly" # forces replacement
      ~ external_ids      = [] -> (known after apply)
      ~ group_id          = "7c7d65e8-1081-7065-75df-06dd351e36a9" -> (known after apply)
      ~ id                = "d-9d67173bdd/7c7d65e8-1081-7065-75df-06dd351e36a9" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Access-ECS-Blazer"] will be destroyed
  # (because key ["Notify-Production-Access-ECS-Blazer"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_production" {
      - id                 = "3cdd2568-3011-7030-4f92-b48f54bf29a8,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-d12df5fad74b8e69,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-d12df5fad74b8e69" -> null
      - principal_id       = "3cdd2568-3011-7030-4f92-b48f54bf29a8" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "296255494825" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Access-QuickSight"] will be destroyed
  # (because key ["Notify-Production-Access-QuickSight"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_production" {
      - id                 = "8ccd6538-40e1-70f7-b3b4-97cf64608a14,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf" -> null
      - principal_id       = "8ccd6538-40e1-70f7-b3b4-97cf64608a14" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "296255494825" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin-Pinpoint-SMS"] will be destroyed
  # (because key ["Notify-Production-Admin-Pinpoint-SMS"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_production" {
      - id                 = "3ccd2518-e051-705f-476c-e4db031b1b31,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-be3f358dd5f9b774,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-be3f358dd5f9b774" -> null
      - principal_id       = "3ccd2518-e051-705f-476c-e4db031b1b31" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "296255494825" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin-S3-WebsiteAssets"] will be destroyed
  # (because key ["Notify-Production-Admin-S3-WebsiteAssets"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_production" {
      - id                 = "3cdd8588-b001-7075-e6af-075e708ac27c,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c23ca3987a09602f,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c23ca3987a09602f" -> null
      - principal_id       = "3cdd8588-b001-7075-e6af-075e708ac27c" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "296255494825" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin-SupportCenter"] will be destroyed
  # (because key ["Notify-Production-Admin-SupportCenter"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_production" {
      - id                 = "bcfd35b8-3031-70ab-179a-5d746590354f,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-7a9fcd184d647af8,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-7a9fcd184d647af8" -> null
      - principal_id       = "bcfd35b8-3031-70ab-179a-5d746590354f" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "296255494825" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Billing-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-ECS-Blazer-Access"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Pinpoint-SMS-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-QuickSight-Access"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-ReadOnly-Billing"] will be destroyed
  # (because key ["Notify-Production-ReadOnly-Billing"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_production" {
      - id                 = "cc9d4548-a001-7083-383f-3cc9f0f4124a,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c9084467f2ed3090,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c9084467f2ed3090" -> null
      - principal_id       = "cc9d4548-a001-7083-383f-3cc9f0f4124a" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "296255494825" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-S3-WebsiteAssets-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-SupportCenter-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Access-ECS-Blazer"] will be destroyed
  # (because key ["Notify-Staging-Access-ECS-Blazer"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_staging" {
      - id                 = "6ceda5f8-00f1-7020-37f6-7082ffd66e97,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-d12df5fad74b8e69,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-d12df5fad74b8e69" -> null
      - principal_id       = "6ceda5f8-00f1-7020-37f6-7082ffd66e97" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "239043911459" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin-Pinpoint-SMS"] will be destroyed
  # (because key ["Notify-Staging-Admin-Pinpoint-SMS"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_staging" {
      - id                 = "6cfd2548-f071-70e7-cf44-6ad379410b49,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-be3f358dd5f9b774,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-be3f358dd5f9b774" -> null
      - principal_id       = "6cfd2548-f071-70e7-cf44-6ad379410b49" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "239043911459" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin-S3-WebsiteAssets"] will be destroyed
  # (because key ["Notify-Staging-Admin-S3-WebsiteAssets"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_staging" {
      - id                 = "dc0de538-e0d1-70a9-0a9a-857046dcccaa,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c23ca3987a09602f,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c23ca3987a09602f" -> null
      - principal_id       = "dc0de538-e0d1-70a9-0a9a-857046dcccaa" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "239043911459" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin-SupportCenter"] will be destroyed
  # (because key ["Notify-Staging-Admin-SupportCenter"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_staging" {
      - id                 = "1c4d9558-a031-7021-70cf-c90a701d4fef,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-7a9fcd184d647af8,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-7a9fcd184d647af8" -> null
      - principal_id       = "1c4d9558-a031-7021-70cf-c90a701d4fef" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "239043911459" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Billing-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-ECS-Blazer-Access"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Pinpoint-SMS-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-ReadOnly-Billing"] will be destroyed
  # (because key ["Notify-Staging-ReadOnly-Billing"] is not in for_each map)
  - resource "aws_ssoadmin_account_assignment" "notify_staging" {
      - id                 = "7c7d65e8-1081-7065-75df-06dd351e36a9,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c9084467f2ed3090,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c9084467f2ed3090" -> null
      - principal_id       = "7c7d65e8-1081-7065-75df-06dd351e36a9" -> null
      - principal_type     = "GROUP" -> null
      - target_id          = "239043911459" -> null
      - target_type        = "AWS_ACCOUNT" -> null
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-S3-WebsiteAssets-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-SupportCenter-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_managed_policy_attachment.access_quicksight["arn:aws:iam::aws:policy/AWSQuickSightIoTAnalyticsAccess"] must be replaced
-/+ resource "aws_ssoadmin_managed_policy_attachment" "access_quicksight" {
      ~ id                  = "arn:aws:iam::aws:policy/AWSQuickSightIoTAnalyticsAccess,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> (known after apply)
      ~ managed_policy_name = "AWSQuickSightIoTAnalyticsAccess" -> (known after apply)
      ~ permission_set_arn  = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_ssoadmin_managed_policy_attachment.access_quicksight["arn:aws:iam::aws:policy/service-role/AWSQuickSightDescribeRDS"] must be replaced
-/+ resource "aws_ssoadmin_managed_policy_attachment" "access_quicksight" {
      ~ id                  = "arn:aws:iam::aws:policy/service-role/AWSQuickSightDescribeRDS,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> (known after apply)
      ~ managed_policy_name = "AWSQuickSightDescribeRDS" -> (known after apply)
      ~ permission_set_arn  = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_ssoadmin_managed_policy_attachment.access_quicksight["arn:aws:iam::aws:policy/service-role/AWSQuickSightDescribeRedshift"] must be replaced
-/+ resource "aws_ssoadmin_managed_policy_attachment" "access_quicksight" {
      ~ id                  = "arn:aws:iam::aws:policy/service-role/AWSQuickSightDescribeRedshift,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> (known after apply)
      ~ managed_policy_name = "AWSQuickSightDescribeRedshift" -> (known after apply)
      ~ permission_set_arn  = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_ssoadmin_managed_policy_attachment.access_quicksight["arn:aws:iam::aws:policy/service-role/AWSQuickSightElasticsearchPolicy"] must be replaced
-/+ resource "aws_ssoadmin_managed_policy_attachment" "access_quicksight" {
      ~ id                  = "arn:aws:iam::aws:policy/service-role/AWSQuickSightElasticsearchPolicy,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> (known after apply)
      ~ managed_policy_name = "AWSQuickSightElasticsearchPolicy" -> (known after apply)
      ~ permission_set_arn  = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_ssoadmin_managed_policy_attachment.access_quicksight["arn:aws:iam::aws:policy/service-role/AWSQuickSightListIAM"] must be replaced
-/+ resource "aws_ssoadmin_managed_policy_attachment" "access_quicksight" {
      ~ id                  = "arn:aws:iam::aws:policy/service-role/AWSQuickSightListIAM,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> (known after apply)
      ~ managed_policy_name = "AWSQuickSightListIAM" -> (known after apply)
      ~ permission_set_arn  = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_ssoadmin_managed_policy_attachment.access_quicksight["arn:aws:iam::aws:policy/service-role/AWSQuickSightTimestreamPolicy"] must be replaced
-/+ resource "aws_ssoadmin_managed_policy_attachment" "access_quicksight" {
      ~ id                  = "arn:aws:iam::aws:policy/service-role/AWSQuickSightTimestreamPolicy,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> (known after apply)
      ~ managed_policy_name = "AWSQuickSightTimestreamPolicy" -> (known after apply)
      ~ permission_set_arn  = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  #...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.access_quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_pinpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_support_center"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.notify_access_ecs_blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.read_only_billing"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
